nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_i2c_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c9_dma_driver_state")
cmsis_i2c_dma_driver_state_t I2C9_DmaDriverState = {
#else
cmsis_i2c_dma_driver_state_t I2C9_DmaDriverState  = {
#endif
    &I2C9_Resource,
    &I2C9_DmaResource,
    &I2C9_DmaHandle,
    &I2C9_DmaTxRxHandle,
};

static int32_t I2C9_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C9_InitPins();
    return I2C_Master_DmaInitialize(cb_event, &I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaUninitialize(void)
{
    I2C9_DeinitPins();
    return I2C_Master_DmaUninitialize(&I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_DmaPowerControl(state, &I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaGetDataCount(void)
{
    return I2C_Master_DmaGetDataCount(&I2C9_DmaDriverState);
}

int32_t I2C9_Master_DmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_DmaControl(control, arg, &I2C9_DmaDriverState);
}

ARM_I2C_STATUS I2C9_Master_DmaGetStatus(void)
{
    return I2C_Master_DmaGetStatus(&I2C9_DmaDriverState);
}

#endif

#else

cmsis_i2c_handle_t I2C9_handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c9_interrupt_driver_state")
cmsis_i2c_interrupt_driver_state_t I2C9_InterruptDriverState = {
#else
cmsis_i2c_interrupt_driver_state_t I2C9_InterruptDriverState  = {
#endif
    &I2C9_Resource,
    &I2C9_handle,

};

static int32_t I2C9_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C9_InitPins();
    return I2C_InterruptInitialize(cb_event, &I2C9_InterruptDriverState);
}

static int32_t I2C9_InterruptUninitialize(void)
{
    I2C9_DeinitPins();
    return I2C_InterruptUninitialize(&I2C9_InterruptDriverState);
}

static int32_t I2C9_InterruptPowerControl(ARM_POWER_STATE state)
{
    return I2C_InterruptPowerControl(state, &I2C9_InterruptDriverState);
}

int32_t I2C9_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C9_InterruptDriverState);
}

int32_t I2C9_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C9_InterruptDriverState);
}

int32_t I2C9_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptTransmit(data, num, &I2C9_InterruptDriverState);
}

int32_t I2C9_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptReceive(data, num, &I2C9_InterruptDriverState);
}

int32_t I2C9_InterruptGetDataCount(void)
{
    return I2C_InterruptGetDataCount(&I2C9_InterruptDriverState);
}

int32_t I2C9_InterruptControl(uint32_t control, uint32_t arg)
{
    return I2C_InterruptControl(control, arg, &I2C9_InterruptDriverState);
}

ARM_I2C_STATUS I2C9_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C9_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C9 = {I2Cx_GetVersion,
                              I2Cx_GetCapabilities,
#if RTE_I2C9_DMA_EN
                              I2C9_Master_DmaInitialize,
                              I2C9_Master_DmaUninitialize,
                              I2C9_Master_DmaPowerControl,
                              I2C9_Master_DmaTransmit,
                              I2C9_Master_DmaReceive,
                              NULL,
                              NULL,
                              I2C9_Master_DmaGetDataCount,
                              I2C9_Master_DmaControl,
                              I2C9_Master_DmaGetStatus
#else
                              I2C9_InterruptInitialize,
                              I2C9_InterruptUninitialize,
                              I2C9_InterruptPowerControl,
                              I2C9_Master_InterruptTransmit,
                              I2C9_Master_InterruptReceive,
                              I2C9_Slave_InterruptTransmit,
                              I2C9_Slave_InterruptReceive,
                              I2C9_InterruptGetDataCount,
                              I2C9_InterruptControl,
                              I2C9_InterruptGetStatus
#endif
};

#endif

#if defined(I2C10) && RTE_I2C10

/* User needs to provide the implementation for I2C10_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C10_GetFreq(void);
extern void I2C10_InitPins(void);
extern void I2C10_DeinitPins(void);

cmsis_i2c_resource_t I2C10_Resource = {I2C10, I2C10_GetFreq};

#if RTE_I2C10_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_i2c_dma_resource_t I2C10_DmaResource = {RTE_I2C10_Master_DMA_BASE, RTE_I2C10_Master_DMA_CH};

i2c_master_dma_handle_t I2C10_DmaHandle;
dma_handle_t I2C10_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c10_dma_driver_state")
cmsis_i2c_dma_driver_state_t I2C10_DmaDriverState = {
#else
cmsis_i2c_dma_driver_state_t I2C10_DmaDriverState = {
#endif
    &I2C10_Resource,
    &I2C10_DmaResource,
    &I2C10_DmaHandle,
    &I2C10_DmaTxRxHandle,
};

static int32_t I2C10_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C10_InitPins();
    return I2C_Master_DmaInitialize(cb_event, &I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaUninitialize(void)
{
    I2C10_DeinitPins();
    return I2C_Master_DmaUninitialize(&I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_DmaPowerControl(state, &I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaGetDataCount(void)
{
    return I2C_Master_DmaGetDataCount(&I2C10_DmaDriverState);
}

int32_t I2C10_Master_DmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_DmaControl(control, arg, &I2C10_DmaDriverState);
}

ARM_I2C_STATUS I2C10_Master_DmaGetStatus(void)
{
    return I2C_Master_DmaGetStatus(&I2C10_DmaDriverState);
}

#endif

#else

