nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_i2c_cmsis.c
cmsis_i2c_handle_t I2C10_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c10_interrupt_driver_state")
cmsis_i2c_interrupt_driver_state_t I2C10_InterruptDriverState = {
#else
cmsis_i2c_interrupt_driver_state_t I2C10_InterruptDriverState = {
#endif
    &I2C10_Resource,
    &I2C10_Handle,
};

static int32_t I2C10_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C10_InitPins();
    return I2C_InterruptInitialize(cb_event, &I2C10_InterruptDriverState);
}

static int32_t I2C10_InterruptUninitialize(void)
{
    I2C10_DeinitPins();
    return I2C_InterruptUninitialize(&I2C10_InterruptDriverState);
}

static int32_t I2C10_InterruptPowerControl(ARM_POWER_STATE state)
{
    return I2C_InterruptPowerControl(state, &I2C10_InterruptDriverState);
}

int32_t I2C10_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C10_InterruptDriverState);
}

int32_t I2C10_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C10_InterruptDriverState);
}

int32_t I2C10_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptTransmit(data, num, &I2C10_InterruptDriverState);
}

int32_t I2C10_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptReceive(data, num, &I2C10_InterruptDriverState);
}

int32_t I2C10_InterruptGetDataCount(void)
{
    return I2C_InterruptGetDataCount(&I2C10_InterruptDriverState);
}

int32_t I2C10_InterruptControl(uint32_t control, uint32_t arg)
{
    return I2C_InterruptControl(control, arg, &I2C10_InterruptDriverState);
}

ARM_I2C_STATUS I2C10_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C10_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C10 = {I2Cx_GetVersion,
                               I2Cx_GetCapabilities,
#if RTE_I2C10_DMA_EN
                               I2C10_Master_DmaInitialize,
                               I2C10_Master_DmaUninitialize,
                               I2C10_Master_DmaPowerControl,
                               I2C10_Master_DmaTransmit,
                               I2C10_Master_DmaReceive,
                               NULL,
                               NULL,
                               I2C10_Master_DmaGetDataCount,
                               I2C10_Master_DmaControl,
                               I2C10_Master_DmaGetStatus
#else
                               I2C10_InterruptInitialize,
                               I2C10_InterruptUninitialize,
                               I2C10_InterruptPowerControl,
                               I2C10_Master_InterruptTransmit,
                               I2C10_Master_InterruptReceive,
                               I2C10_Slave_InterruptTransmit,
                               I2C10_Slave_InterruptReceive,
                               I2C10_InterruptGetDataCount,
                               I2C10_InterruptControl,
                               I2C10_InterruptGetStatus
#endif
};

#endif

#if defined(I2C11) && RTE_I2C11

/* User needs to provide the implementation for I2C1_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t I2C11_GetFreq(void);
extern void I2C11_InitPins(void);
extern void I2C11_DeinitPins(void);

cmsis_i2c_resource_t I2C11_Resource = {I2C11, I2C11_GetFreq};

#if RTE_I2C11_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_i2c_dma_resource_t I2C11_DmaResource = {RTE_I2C11_Master_DMA_BASE, RTE_I2C11_Master_DMA_CH};

i2c_master_dma_handle_t I2C11_DmaHandle;
dma_handle_t I2C11_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c11_dma_driver_state")
cmsis_i2c_dma_driver_state_t I2C11_DmaDriverState = {
#else
cmsis_i2c_dma_driver_state_t I2C11_DmaDriverState = {
#endif
    &I2C11_Resource,
    &I2C11_DmaResource,
    &I2C11_DmaHandle,
    &I2C11_DmaTxRxHandle,
};

static int32_t I2C11_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C11_InitPins();
    return I2C_Master_DmaInitialize(cb_event, &I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaUninitialize(void)
{
    I2C11_DeinitPins();
    return I2C_Master_DmaUninitialize(&I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_DmaPowerControl(state, &I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaGetDataCount(void)
{
    return I2C_Master_DmaGetDataCount(&I2C11_DmaDriverState);
}

int32_t I2C11_Master_DmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_DmaControl(control, arg, &I2C11_DmaDriverState);
}

ARM_I2C_STATUS I2C11_Master_DmaGetStatus(void)
{
    return I2C_Master_DmaGetStatus(&I2C11_DmaDriverState);
}

#endif

#else

cmsis_i2c_handle_t I2C11_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c11_interrupt_driver_state")
cmsis_i2c_interrupt_driver_state_t I2C11_InterruptDriverState = {
#else
cmsis_i2c_interrupt_driver_state_t I2C11_InterruptDriverState = {
#endif
    &I2C11_Resource,
    &I2C11_Handle,
};

static int32_t I2C11_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C11_InitPins();
    return I2C_InterruptInitialize(cb_event, &I2C11_InterruptDriverState);
}

static int32_t I2C11_InterruptUninitialize(void)
{
    I2C11_DeinitPins();
    return I2C_InterruptUninitialize(&I2C11_InterruptDriverState);
}

static int32_t I2C11_InterruptPowerControl(ARM_POWER_STATE state)
{
    return I2C_InterruptPowerControl(state, &I2C11_InterruptDriverState);
}

int32_t I2C11_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C11_InterruptDriverState);
}

int32_t I2C11_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C11_InterruptDriverState);
}

int32_t I2C11_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptTransmit(data, num, &I2C11_InterruptDriverState);
}

int32_t I2C11_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptReceive(data, num, &I2C11_InterruptDriverState);
}

int32_t I2C11_InterruptGetDataCount(void)
{
    return I2C_InterruptGetDataCount(&I2C11_InterruptDriverState);
}

int32_t I2C11_InterruptControl(uint32_t control, uint32_t arg)
{
    return I2C_InterruptControl(control, arg, &I2C11_InterruptDriverState);
}

ARM_I2C_STATUS I2C11_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C11_InterruptDriverState);
}

#endif

