nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_i2c_cmsis.c
cmsis_i2c_resource_t I2C13_Resource = {I2C13, I2C13_GetFreq};

#if RTE_I2C13_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_i2c_dma_resource_t I2C13_DmaResource = {RTE_I2C13_Master_DMA_BASE, RTE_I2C13_Master_DMA_CH};

i2c_master_dma_handle_t I2C13_DmaHandle;
dma_handle_t I2C13_DmaTxRxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c13_dma_driver_state")
cmsis_i2c_dma_driver_state_t I2C13_DmaDriverState = {
#else
cmsis_i2c_dma_driver_state_t I2C13_DmaDriverState = {
#endif
    &I2C13_Resource,
    &I2C13_DmaResource,
    &I2C13_DmaHandle,
    &I2C13_DmaTxRxHandle,
};

static int32_t I2C13_Master_DmaInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C13_InitPins();
    return I2C_Master_DmaInitialize(cb_event, &I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaUninitialize(void)
{
    I2C13_DeinitPins();
    return I2C_Master_DmaUninitialize(&I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaPowerControl(ARM_POWER_STATE state)
{
    return I2C_Master_DmaPowerControl(state, &I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaTransmit(addr, data, num, xfer_pending, &I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_DmaReceive(addr, data, num, xfer_pending, &I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaGetDataCount(void)
{
    return I2C_Master_DmaGetDataCount(&I2C13_DmaDriverState);
}

int32_t I2C13_Master_DmaControl(uint32_t control, uint32_t arg)
{
    return I2C_Master_DmaControl(control, arg, &I2C13_DmaDriverState);
}

ARM_I2C_STATUS I2C13_Master_DmaGetStatus(void)
{
    return I2C_Master_DmaGetStatus(&I2C13_DmaDriverState);
}

#endif

#else

cmsis_i2c_handle_t I2C13_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("i2c13_interrupt_driver_state")
cmsis_i2c_interrupt_driver_state_t I2C13_InterruptDriverState = {
#else
cmsis_i2c_interrupt_driver_state_t I2C13_InterruptDriverState = {
#endif
    &I2C13_Resource,
    &I2C13_Handle,
};

static int32_t I2C13_InterruptInitialize(ARM_I2C_SignalEvent_t cb_event)
{
    I2C13_InitPins();
    return I2C_InterruptInitialize(cb_event, &I2C13_InterruptDriverState);
}

static int32_t I2C13_InterruptUninitialize(void)
{
    I2C13_DeinitPins();
    return I2C_InterruptUninitialize(&I2C13_InterruptDriverState);
}

static int32_t I2C13_InterruptPowerControl(ARM_POWER_STATE state)
{
    return I2C_InterruptPowerControl(state, &I2C13_InterruptDriverState);
}

int32_t I2C13_Master_InterruptTransmit(uint32_t addr, const uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptTransmit(addr, data, num, xfer_pending, &I2C13_InterruptDriverState);
}

int32_t I2C13_Master_InterruptReceive(uint32_t addr, uint8_t *data, uint32_t num, bool xfer_pending)
{
    return I2C_Master_InterruptReceive(addr, data, num, xfer_pending, &I2C13_InterruptDriverState);
}

int32_t I2C13_Slave_InterruptTransmit(const uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptTransmit(data, num, &I2C13_InterruptDriverState);
}

int32_t I2C13_Slave_InterruptReceive(uint8_t *data, uint32_t num)
{
    return I2C_Slave_InterruptReceive(data, num, &I2C13_InterruptDriverState);
}

int32_t I2C13_InterruptGetDataCount(void)
{
    return I2C_InterruptGetDataCount(&I2C13_InterruptDriverState);
}

int32_t I2C13_InterruptControl(uint32_t control, uint32_t arg)
{
    return I2C_InterruptControl(control, arg, &I2C13_InterruptDriverState);
}

ARM_I2C_STATUS I2C13_InterruptGetStatus(void)
{
    return I2C_InterruptGetStatus(&I2C13_InterruptDriverState);
}

#endif

ARM_DRIVER_I2C Driver_I2C13 = {I2Cx_GetVersion,
                               I2Cx_GetCapabilities,
#if RTE_I2C13_DMA_EN
                               I2C13_Master_DmaInitialize,
                               I2C13_Master_DmaUninitialize,
                               I2C13_Master_DmaPowerControl,
                               I2C13_Master_DmaTransmit,
                               I2C13_Master_DmaReceive,
                               NULL,
                               NULL,
                               I2C13_Master_DmaGetDataCount,
                               I2C13_Master_DmaControl,
                               I2C13_Master_DmaGetStatus
#else
                               I2C13_InterruptInitialize,
                               I2C13_InterruptUninitialize,
                               I2C13_InterruptPowerControl,
                               I2C13_Master_InterruptTransmit,
                               I2C13_Master_InterruptReceive,
                               I2C13_Slave_InterruptTransmit,
                               I2C13_Slave_InterruptReceive,
                               I2C13_InterruptGetDataCount,
                               I2C13_InterruptControl,
                               I2C13_InterruptGetStatus
#endif
};

#endif
